#include<stdio.h>
#include"hello.h"

voidHe_init()
{
    int c;
    if(NOW <= -3)
    {
        system("cls");
        puts("爆炸爆炸爆炸密码错误爆炸爆炸爆炸爆炸爆炸");
        puts("爆炸爆炸爆炸密码错误爆炸爆炸爆炸爆炸爆炸");
        puts("爆炸爆炸爆炸密码错误爆炸爆炸爆炸爆炸爆炸");
        puts("爆炸爆炸爆炸密码错误爆炸爆炸爆炸爆炸爆炸");
        puts("爆炸爆炸爆炸密码错误爆炸爆炸爆炸爆炸爆炸");
        puts("爆炸爆炸爆炸密码错误爆炸爆炸爆炸爆炸爆炸");
        puts("爆炸爆炸爆炸密码错误爆炸爆炸爆炸爆炸爆炸");
        puts("爆炸爆炸爆炸密码错误爆炸爆炸爆炸爆炸爆炸");
        puts("爆炸爆炸爆炸密码错误爆炸爆炸爆炸爆炸爆炸");
        puts("爆炸爆炸爆炸密码错误爆炸爆炸爆炸爆炸爆炸");
        NOW = 100;
        return;
    }
    else if(NOW == 0)
    {
        system("cls");
        puts("***********************************");
        puts("***********0.请登录****************");
        puts("***********0.请登录****************");
        puts("***********************************");
        printf("请选择程序功能：");
        scanf("%d", &c);
        if(c == 0)//登录
        {
            if(IsRight() != 1)
            {
                puts("密码错误");
                system("pause");
                //system("pause");
            }
            else 
            {
                puts("欢迎管理员");
                system("pause");
            }
        }
        else 
        {
            puts("输入格式有问题");
            system("pause");
        }
    }
    else if(NOW<0)
    {
        system("cls");
        puts("*******密码错误三次将爆炸***********");
        puts("***********0.请登录****************");
        puts("***********0.请登录****************");
        puts("***********密码错误****************");
        printf("***********已错误%d次***************\n", -NOW);
        printf("请选择程序功能：");
        scanf("%d", &c);
        if(c == 0)//登录
        {
            if(IsRight() == 0)
            {
                puts("密码错误");
                system("pause");
            }
            else 
            {
                puts("欢迎管理员");
                system("pause");
            }
        }
        else 
        {
            puts("输入有问题");
            system("pause");
        }
    }
    else 
    {
        system("cls");
        puts("**********************************");
        puts("*************0.卡内充值***********");
        puts("*************1.停车***************");
        puts("*************2.取车***************");
        puts("*************3.查车***************");
        puts("*************4.退出***************");
        puts("*************5.退出程序***********");
        puts("*************6.配置系统***********");
        puts("**********************************");
        printf("请选择程序功能：");
        scanf("%d", &c);
        if(c == 0)//结账
        {}
        else if(c == 1)//车来
        {}
        else if(c == 2)//车走
        {}
        else if(c == 3)//车在哪
        {}
        else if(c == 4)//车在哪
        {
            NOW = 0;
        }
        else if(c == 5)//车在哪
        {
            NOW = 100;
        }
        else if(c == 6)
        {}
        else 
        {
            puts("输入有问题");
            system("pause");
        }
    }
}
